# Запрос версии 0xB6, 0x49, 0x1B, <адрес мл. байт>, <адрес ст. байт>, 0x01, 0x80, <CRC16 мл. байт>, <CRC16 ст. байт>
query_version = b"B6 49 1B sn_lb sn_hb 01 80 crc_lb crc_hb"
# Ответ  0xB9, 0x46, 0x1B, <адрес мл. байт>, <адрес ст. байт>, 0x03, 0x00, <Версия ПО>, <Подверсия ПО>, <CRC16 мл. байт>, <CRC16 ст. байт>
response_version = b"B9 46 1B sn_lb sn_hb 03 00 ver_po sub_ver_po crc_lb crc_hb"

# Команда сканирования: 0xB6, 0x49, 0x1B, <адрес мл. байт>, <адрес ст. байт>, 0x09, 0x81, <время положит. импульса (x100 мс) выхода 1>, <время отриц. импульса (x100 мс) выхода 1>, <...2>, <...2>, <...3>, <...3>, <...4>, <...4>, <CRC16 мл. байт>, <CRC16 ст. байт>
query_scan = b"B6 49 1B sn_lb sn_hb 09 81 t_pos_impuls t_neg_impuls <...2> <...2> <...3> <...3> <...4> <...4> crc_lb crc_hb"
# Ответ 0xB9, 0x46, 0x1B, <адрес мл. байт>, <адрес ст. байт>, 0x04, 0x01, 0x00(или 0x80 после старта, <АЦПuвх>, <Cостояния выходов>, <CRC16 мл. байт>, <CRC16 ст. байт>
response_scan = b"B9 46 1B sn_lb sn_hb 04 01 00 | 80 (start) acp_u_in state_out crc_lb crc_hb"


